jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
/*
 * MIPI-DSI Display Driver Base Implementation (Direct ESP-IDF)
 * 
 * Shared implementation for all MIPI-DSI panel drivers on ESP32-P4.
 * Calls ESP-IDF MIPI-DSI APIs directly for:
 *   - DMA2D async flush (hardware-accelerated pixel copy)
 *   - disable_lp=true (continuous HS mode during blanking)
 *   - Backlight PWM control
 *   - Panel reset and initialization
 * 
 * Subclasses only need to provide their vendor init commands and DSI timing.
 */

#include "mipi_dsi_driver.h"
#include "../log_manager.h"
#include <string.h>

// MIPI DSI PHY power supply (LDO channel 3 on ESP32-P4)
#define MIPI_DSI_PHY_PWR_LDO_CHAN       3
#define MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV 2500

// Forward declaration of PPA completion callback (defined below pushColors).
bool onPpaDone(ppa_client_handle_t client,
               ppa_event_data_t* event_data,
               void* user_data);

// DMA2D completion callback — called from ISR when draw_bitmap finishes
// copying the LVGL buffer into the DPI framebuffer.  Signals LVGL that
// the draw buffer can be recycled.
static bool IRAM_ATTR onColorTransDone(esp_lcd_panel_handle_t panel,
                                       esp_lcd_dpi_panel_event_data_t* edata,
                                       void* user_ctx) {
    g_displayFlushBusy = false;
    lv_display_t* disp = (lv_display_t*)user_ctx;
    lv_display_flush_ready(disp);
    return false;
}

MipiDsiDriver::MipiDsiDriver()
    : framebuffer(nullptr), panel_handle(nullptr), ioHandle(nullptr),
      rotBuffer(nullptr), ppaClient(nullptr),
      currentBrightness(100),
      displayWidth(DISPLAY_WIDTH), displayHeight(DISPLAY_HEIGHT), displayRotation(DISPLAY_ROTATION),
      backlightOn(false), flushX(0), flushY(0), flushW(0), flushH(0), lvglDisplay(nullptr),
      physX(0), physY(0), physW(0), physH(0)
{
}

MipiDsiDriver::~MipiDsiDriver() {
    // Display is never torn down during normal operation.
}

void MipiDsiDriver::init() {
    const char* tag = getLogTag();
    MipiDsiTimingConfig timing = getTimingConfig();

    // ----------------------------------------------------------------
    // Attach backlight PWM BEFORE the LCD panel starts.
    // Configuring PWM first avoids GPIO glitches during panel scan start.
    // ----------------------------------------------------------------
    #ifdef LCD_BL_PIN
    #if HAS_BACKLIGHT
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttachChannel(LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, 8, TFT_BACKLIGHT_PWM_CHANNEL);
    ledcWrite(LCD_BL_PIN, 0);
    LOGI(tag, "Backlight PWM: GPIO%d, %dHz, 8-bit, ch%d (OFF)",
         LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, TFT_BACKLIGHT_PWM_CHANNEL);
    #else
    ledcSetup(TFT_BACKLIGHT_PWM_CHANNEL, TFT_BACKLIGHT_PWM_FREQ, 8);
    ledcAttachPin(LCD_BL_PIN, TFT_BACKLIGHT_PWM_CHANNEL);
    ledcWrite(TFT_BACKLIGHT_PWM_CHANNEL, 0);
    LOGI(tag, "Backlight PWM: GPIO%d, %dHz, 8-bit, ch%d (OFF)",
         LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, TFT_BACKLIGHT_PWM_CHANNEL);
    #endif
    #else
    pinMode(LCD_BL_PIN, OUTPUT);
    #ifdef TFT_BACKLIGHT_ON
    digitalWrite(LCD_BL_PIN, !TFT_BACKLIGHT_ON);
    #else
    digitalWrite(LCD_BL_PIN, LOW);
    #endif
    LOGI(tag, "Backlight digital: GPIO%d (OFF)", LCD_BL_PIN);
    #endif
    #endif
    
    // ----------------------------------------------------------------
    // Panel hardware reset
    // ----------------------------------------------------------------
    #ifdef LCD_RST_PIN
    pinMode(LCD_RST_PIN, OUTPUT);
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(5);
    digitalWrite(LCD_RST_PIN, LOW);
    delay(10);
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(120);
    LOGI(tag, "Panel reset: GPIO%d (HIGH-LOW-HIGH, 120ms)", LCD_RST_PIN);
    #endif
    
    // ----------------------------------------------------------------
    // Direct ESP-IDF MIPI-DSI initialization
    // ----------------------------------------------------------------
    
    LOGI(tag, "Initializing MIPI-DSI via direct ESP-IDF calls");
    LOGI(tag, "DSI timing: DPI_CLK=%luHz, lane_rate=%lu Mbps",
         (unsigned long)timing.dpi_clock_hz, (unsigned long)timing.lane_bit_rate_mbps);
    LOGI(tag, "DSI HSYNC: pw=%lu, bp=%lu, fp=%lu",
         (unsigned long)timing.hsync_pulse_width, (unsigned long)timing.hsync_back_porch,
         (unsigned long)timing.hsync_front_porch);
    LOGI(tag, "DSI VSYNC: pw=%lu, bp=%lu, fp=%lu",
         (unsigned long)timing.vsync_pulse_width, (unsigned long)timing.vsync_back_porch,
         (unsigned long)timing.vsync_front_porch);
    LOGI(tag, "DSI flags: disable_lp=%s, use_dma2d=true",
         timing.disable_lp ? "true" : "false");
    
    // 1. Power on MIPI DSI PHY via internal LDO (LDO_VO3 → VDD_MIPI_DPHY)
    esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
    esp_ldo_channel_config_t ldo_config = {
        .chan_id = MIPI_DSI_PHY_PWR_LDO_CHAN,
        .voltage_mv = MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
    };
    ESP_ERROR_CHECK(esp_ldo_acquire_channel(&ldo_config, &ldo_mipi_phy));
    LOGI(tag, "MIPI DSI PHY powered on (LDO ch%d, %dmV)",
         MIPI_DSI_PHY_PWR_LDO_CHAN, MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV);
    
    // 2. Create DSI bus (2-lane, configured bit rate)
    esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = 2,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = timing.lane_bit_rate_mbps,
    };
    esp_lcd_dsi_bus_handle_t mipi_dsi_bus = NULL;
    ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus));
    
    // 3. Create DBI IO for DSI command channel (vendor init commands)
    esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    esp_lcd_panel_io_handle_t io_handle = NULL;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &io_handle));
    ioHandle = io_handle;  // Store for runtime DCS commands (sleep/wake)
    
    // 4. Create DPI panel with disable_lp=true and use_dma2d=true
    //    disable_lp: keeps D-PHY in HS mode during blanking (avoids flicker)
    //    use_dma2d: hardware-accelerated async pixel copy (avoids blocking CPU)
    //    num_fbs=2: double-buffered framebuffer. ESP-IDF mirrors draw_bitmap
    //      writes across both FBs so partial flushes stay coherent, and
    //      scanout reads one FB while draw_bitmap writes the other —
    //      eliminates the tear/flicker window inherent to single-FB mode.
    esp_lcd_dpi_panel_config_t dpi_config = {
        .virtual_channel = 0,
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = (uint32_t)(timing.dpi_clock_hz / 1000000),
        .pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565,
        .num_fbs = 2,
        .video_timing = {
            .h_size = displayWidth,
            .v_size = displayHeight,
            .hsync_pulse_width = timing.hsync_pulse_width,
            .hsync_back_porch = timing.hsync_back_porch,
            .hsync_front_porch = timing.hsync_front_porch,
            .vsync_pulse_width = timing.vsync_pulse_width,
            .vsync_back_porch = timing.vsync_back_porch,
            .vsync_front_porch = timing.vsync_front_porch,
        },
        .flags = {
            .use_dma2d = true,
            .disable_lp = timing.disable_lp,
        },
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_dpi(mipi_dsi_bus, &dpi_config, &panel_handle));
    
    // 5. Send vendor init commands via DSI command mode
    sendInitCommands();
    
