jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
    // 6. Initialize DPI panel — starts continuous DMA refresh from PSRAM
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    
    // 7. Get PSRAM framebuffer pointers (allocated by ESP-IDF during panel creation).
    //    With num_fbs=2 the driver ping-pongs between fb0 and fb1 internally.
    void* fb0 = nullptr;
    void* fb1 = nullptr;
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_get_frame_buffer(panel_handle, 2, &fb0, &fb1));
    framebuffer = (uint16_t*)fb0;
    
    LOGI(tag, "DSI initialized: %dx%d, disable_lp=%s, use_dma2d=true, dual FB @ %p / %p",
         displayWidth, displayHeight, timing.disable_lp ? "true" : "false", fb0, fb1);
    
    delay(50);
    setBacklightBrightness(currentBrightness);
    
    // Rotation via PPA hardware (Pixel Processing Accelerator).
    // The DPI panel driver does NOT support swap_xy/mirror ops, so we
    // rotate each tile in pushColors() using PPA SRM before draw_bitmap().
    if (displayRotation != 0) {
        size_t rotBufSize = LVGL_BUFFER_SIZE * sizeof(uint16_t);
        rotBufSize = (rotBufSize + 63) & ~63; // cache-line alignment
        rotBuffer = (uint16_t*)heap_caps_aligned_alloc(64, rotBufSize, MALLOC_CAP_SPIRAM);
        if (!rotBuffer) {
            LOGE(tag, "Failed to allocate PPA rotation buffer (%u bytes)", (unsigned)rotBufSize);
        } else {
            ppa_client_config_t ppa_cfg = { .oper_type = PPA_OPERATION_SRM };
            ESP_ERROR_CHECK(ppa_register_client(&ppa_cfg, &ppaClient));
            // Register PPA async completion callback — chains into draw_bitmap()
            // after each tile rotation finishes.
            ppa_event_callbacks_t ppa_cbs = {};
            ppa_cbs.on_trans_done = onPpaDone;
            ESP_ERROR_CHECK(ppa_client_register_event_callbacks(ppaClient, &ppa_cbs));
            LOGI(tag, "PPA async rotation enabled: %u byte buffer @ %p", (unsigned)rotBufSize, rotBuffer);
        }
    }

    LOGI(tag, "Display ready: %dx%d @ rotation %d", width(), height(), displayRotation);
}

void MipiDsiDriver::setRotation(uint8_t rotation) {
    displayRotation = rotation;
}

int MipiDsiDriver::width() {
    return (displayRotation == 1 || displayRotation == 3) ? displayHeight : displayWidth;
}

int MipiDsiDriver::height() {
    return (displayRotation == 1 || displayRotation == 3) ? displayWidth : displayHeight;
}

void MipiDsiDriver::setBacklight(bool on) {
    setBacklightBrightness(on ? 100 : 0);
}

void MipiDsiDriver::setBacklightBrightness(uint8_t brightness) {
    if (brightness > 100) brightness = 100;
    currentBrightness = brightness;
    backlightOn = (brightness > 0);

    #ifdef LCD_BL_PIN
    #if HAS_BACKLIGHT
    uint32_t duty = 0;
    if (brightness >= 100) {
        duty = 255;
    } else if (brightness > 0) {
        duty = TFT_BACKLIGHT_DUTY_MIN + ((uint32_t)(brightness - 1) * (TFT_BACKLIGHT_DUTY_MAX - TFT_BACKLIGHT_DUTY_MIN)) / 98;
    }
    #ifdef TFT_BACKLIGHT_ON
    if (!TFT_BACKLIGHT_ON) duty = 255 - duty;
    #endif
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(LCD_BL_PIN, duty);
    #else
    ledcWrite(TFT_BACKLIGHT_PWM_CHANNEL, duty);
    #endif
    #else
    #ifdef TFT_BACKLIGHT_ON
    digitalWrite(LCD_BL_PIN, backlightOn ? TFT_BACKLIGHT_ON : !TFT_BACKLIGHT_ON);
    #else
    digitalWrite(LCD_BL_PIN, backlightOn ? HIGH : LOW);
    #endif
    #endif
    #endif
}

uint8_t MipiDsiDriver::getBacklightBrightness() {
    return currentBrightness;
}

bool MipiDsiDriver::hasBacklightControl() {
    #ifdef LCD_BL_PIN
    return true;
    #else
    return false;
    #endif
}

void MipiDsiDriver::applyDisplayFixes() {
    // No specific fixes needed for MIPI-DSI panels
}

void MipiDsiDriver::startWrite() {
    // No-op: esp_lcd_panel_draw_bitmap() in pushColors() handles everything
}

void MipiDsiDriver::endWrite() {
    // No-op: esp_lcd_panel_draw_bitmap() in pushColors() handles everything
}

void MipiDsiDriver::setAddrWindow(int16_t x, int16_t y, uint16_t w, uint16_t h) {
    flushX = x;
    flushY = y;
    flushW = w;
    flushH = h;
}

// PPA completion callback — called from PPA driver when async rotation finishes.
// Chains into draw_bitmap() which triggers DMA2D async copy to framebuffer.
// Safe because LVGL won't issue a new pushColors() until flush_ready() fires
// after the subsequent DMA2D copy completes (onColorTransDone ISR).
bool onPpaDone(ppa_client_handle_t client,
               ppa_event_data_t* event_data,
               void* user_ctx) {
    MipiDsiDriver* driver = (MipiDsiDriver*)user_ctx;
    // Issue DMA2D copy of rotated buffer to framebuffer.
    // g_displayFlushBusy was already set at the top of pushColors() and
    // remains true until onColorTransDone clears it.
    esp_lcd_panel_draw_bitmap(driver->panel_handle,
                              driver->physX, driver->physY,
                              driver->physX + driver->physW,
                              driver->physY + driver->physH,
                              driver->rotBuffer);
    // Note: DMA2D completion is handled by onColorTransDone → flush_ready
    return false;
}

void MipiDsiDriver::pushColors(uint16_t* data, uint32_t len, bool swap_bytes) {
    if (!panel_handle || !data || flushW == 0 || flushH == 0) {
        return;
    }

    // Mark flush in-flight for the entire duration of the push, covering both
    // the non-rotated direct DMA2D path and the rotated PPA→DMA2D chain.
    // Cleared by onColorTransDone ISR after the final DMA2D copy completes.
    g_displayFlushBusy = true;

    if (displayRotation == 0 || !rotBuffer || !ppaClient) {
        // No rotation — direct DMA2D async copy
        esp_lcd_panel_draw_bitmap(panel_handle,
                                  flushX, flushY,
                                  flushX + flushW, flushY + flushH,
                                  data);
        return;
    }

    // Rotate tile via ESP32-P4 PPA hardware, then DMA2D copy to framebuffer.
    // LVGL works in logical (portrait) coordinates; we transform each tile
    // to physical (landscape) panel coordinates.
    int px, py, pw, ph;
    ppa_srm_rotation_angle_t angle;

    if (displayRotation == 1) {
        // 90° CW: portrait → landscape
        // Logical (lx,ly) → Physical (displayWidth-1-ly, lx)
        px = displayWidth - flushY - flushH;
        py = flushX;
        pw = flushH;
        ph = flushW;
        angle = PPA_SRM_ROTATION_ANGLE_270; // 270° CCW = 90° CW
    } else if (displayRotation == 2) {
        // 180°
        px = displayWidth - flushX - flushW;
        py = displayHeight - flushY - flushH;
        pw = flushW;
        ph = flushH;
        angle = PPA_SRM_ROTATION_ANGLE_180;
    } else {
        // 270° CW (rotation == 3)
        // Logical (lx,ly) → Physical (ly, displayHeight-1-lx)
        px = flushY;
        py = displayHeight - flushX - flushW;
        pw = flushH;
        ph = flushW;
        angle = PPA_SRM_ROTATION_ANGLE_90; // 90° CCW = 270° CW
    }

    size_t outBufSize = (size_t)pw * ph * sizeof(uint16_t);
    outBufSize = (outBufSize + 63) & ~63; // cache-line alignment

    ppa_srm_oper_config_t srm = {};
    srm.in.buffer = data;
    srm.in.pic_w = flushW;
    srm.in.pic_h = flushH;
    srm.in.block_offset_x = 0;
    srm.in.block_offset_y = 0;
    srm.in.block_w = flushW;
    srm.in.block_h = flushH;
    srm.in.srm_cm = PPA_SRM_COLOR_MODE_RGB565;

    srm.out.buffer = rotBuffer;
    srm.out.buffer_size = outBufSize;
    srm.out.pic_w = pw;
    srm.out.pic_h = ph;
    srm.out.block_offset_x = 0;
    srm.out.block_offset_y = 0;
    srm.out.srm_cm = PPA_SRM_COLOR_MODE_RGB565;

