jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
    srm.rotation_angle = angle;
    srm.scale_x = 1.0f;
    srm.scale_y = 1.0f;

    // Save physical coords for PPA done callback → draw_bitmap().
    // Safe: LVGL won't call pushColors again until flush_ready() fires.
    physX = px;
    physY = py;
    physW = pw;
    physH = ph;

    // Non-blocking: PPA rotates in hardware, then onPpaDone() chains
    // into draw_bitmap() for DMA2D copy.  Meanwhile LVGL can render
    // the next tile into the alternate draw buffer (double buffering).
    srm.mode = PPA_TRANS_MODE_NON_BLOCKING;
    srm.user_data = this;

    esp_err_t err = ppa_do_scale_rotate_mirror(ppaClient, &srm);
    if (err != ESP_OK) {
        LOGE(getLogTag(), "PPA rotate failed: 0x%x", err);
        // Signal flush_ready so LVGL doesn't stall
        lv_display_flush_ready(lvglDisplay);
        return;
    }
}

void MipiDsiDriver::configureLVGL(lv_display_t* disp, uint8_t rotation) {
    lvglDisplay = disp;
    // Register DMA2D completion callback so LVGL knows the draw buffer
    // can be recycled once the hardware copy finishes.
    esp_lcd_dpi_panel_event_callbacks_t cbs = {};
    cbs.on_color_trans_done = onColorTransDone;
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_register_event_callbacks(panel_handle, &cbs, disp));
    LOGI(getLogTag(), "DMA2D flush callback registered");
}

bool MipiDsiDriver::asyncFlush() const {
    return true;
}

// Zero both DPI framebuffers and flush PSRAM cache so the scanout sees black.
// The ESP-IDF DPI peripheral keeps streaming the framebuffer over the MIPI
// lanes at 60 Hz even after DCS Sleep In, so the only reliable way to
// protect IPS cells from hours of identical content (image-persistence /
// ghosting) is to make sure that ongoing scanout reads all-zeros.
// (Note: esp_lcd_panel_disp_on_off() on the DPI panel handle is not
// implemented in our ESP-IDF version — it returns ESP_ERR_NOT_SUPPORTED
// and logs an error — so framebuffer blanking is the actual mitigation.)
// Fill both DPI framebuffers with a byte-uniform RGB565 color (0x0000 black,
// 0xFFFF white) and flush the PSRAM cache so the DPI peripheral's continuous
// scanout reads the new content. The high and low bytes of `color` must match
// for memset to produce the intended pixel value.
void MipiDsiDriver::fillFramebuffers(uint16_t color) {
    if (!panel_handle) return;
    void* fb0 = nullptr;
    void* fb1 = nullptr;
    if (esp_lcd_dpi_panel_get_frame_buffer(panel_handle, 2, &fb0, &fb1) != ESP_OK) {
        return;
    }
    const int fill = (int)(color & 0xFF);
    const size_t fb_bytes = (size_t)displayWidth * (size_t)displayHeight * sizeof(uint16_t);
    if (fb0) {
        memset(fb0, fill, fb_bytes);
        esp_cache_msync(fb0, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
    if (fb1 && fb1 != fb0) {
        memset(fb1, fill, fb_bytes);
        esp_cache_msync(fb1, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
}

void MipiDsiDriver::blankFramebuffers() {
    fillFramebuffers(0x0000);
}

void MipiDsiDriver::sendInitCommands() {
    if (!ioHandle) return;
    const mipi_dsi_init_cmd_t* cmds = getInitCommands();
    const size_t num_cmds = getInitCommandCount();
    for (size_t i = 0; i < num_cmds; i++) {
        ESP_ERROR_CHECK(esp_lcd_panel_io_tx_param(
            ioHandle, cmds[i].cmd, cmds[i].data, cmds[i].data_bytes
        ));
        if (cmds[i].delay_ms > 0) {
            delay(cmds[i].delay_ms);
        }
    }
    LOGI(getLogTag(), "Sent %d vendor init commands", (int)num_cmds);
}

#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
// Deassert RST, wait for the panel IC to come out of reset, then re-run
// the full vendor init sequence. The JD9165 (and most TDDI controllers)
// require only ~10-20 ms post-RST settle before accepting DBI commands;
// 50 ms is a conservative margin that still saves ~70 ms of wake latency
// versus the cold-boot 120 ms. The vendor init table ends with Sleep Out
// (0x11, +120 ms) and Display On (0x29, +50 ms), so no additional DCS
// commands are needed after this returns.
void MipiDsiDriver::wakeFromHardReset() {
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(50);
    sendInitCommands();
}
#else
void MipiDsiDriver::wakeFromHardReset() {}
#endif

void MipiDsiDriver::displaySleep() {
    if (!ioHandle) return;

    // Blank framebuffers so the DPI peripheral's continuous scanout reads
    // black for the entire sleep period (image-retention mitigation).
    // We intentionally do NOT call esp_lcd_panel_disp_on_off(panel, false)
    // here — the DPI panel driver in our ESP-IDF version doesn't implement
    // it and would just log "disp_on_off is not supported by this panel".
    blankFramebuffers();

    // Standard DCS power-down: Display Off → Sleep In.
    esp_lcd_panel_io_tx_param(ioHandle, 0x28, NULL, 0);  // Display Off
    delay(20);
    esp_lcd_panel_io_tx_param(ioHandle, 0x10, NULL, 0);  // Sleep In

    // Optional deep sleep: hold panel RST LOW so the panel IC fully powers
    // down its internal regulators. Required on cheap IPS MIPI-DSI panels
    // (e.g. JD9165) where DCS Sleep In alone leaves the TFT cells DC-biased
    // and slowly drifts VCOM, producing washed-out colors after multi-hour
    // idle. Wake re-runs the vendor init sequence.
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    digitalWrite(LCD_RST_PIN, LOW);
#endif
}

void MipiDsiDriver::displayWake() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
    delay(120);                                           // MIPI DCS spec minimum
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

void MipiDsiDriver::displayWakeSleepOut() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Hard-reset wake is single-phase (see needsTwoPhaseWake()): replay the
    // full init sequence here. The screensaver skips the 120 ms gap and the
    // second displayWakeDisplayOn() call so the display lock is only held
    // once, for the duration of wakeFromHardReset().
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
#endif
}

void MipiDsiDriver::displayWakeDisplayOn() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Unreachable: needsTwoPhaseWake() returns false in hard-reset mode so
    // screen_saver_manager never calls this. Guarded out for safety.
    return;
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

bool MipiDsiDriver::needsTwoPhaseWake() const {
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    return false;
#else
    return true;
#endif
}

// Periodic scrub during long idle, called by the screensaver every
// SCREENSAVER_SLEEP_REFRESH_MS while fully asleep.
//   - Hard-reset mode: actively de-bias the LC by briefly powering the panel
//     up and driving full-frame white↔black inversion cycles (backlight off),
//     then powering it down again. Power-down alone does not de-bias these
//     cheap IPS cells — the trapped DC just relaxes slowly (the washed-out
//     colors that fade a few minutes after wake), so the periodic inversion is
//     what actually prevents the buildup. A soft-landing settle then lets the
//     panel reach VCOM equilibrium before RST is re-asserted LOW; freezing the
//     panel mid-equilibration leaves it in a marginal VCOM state that flickers
//     for minutes on the next wake. Leaves RST LOW + framebuffers black so the
//     normal hard-reset wake path is unchanged.
//   - Otherwise: re-blank both framebuffers as insurance against any transient
//     LVGL write that slipped past the opaque top-layer overlay (e.g. overlay
//     teardown race during fade-in) leaving stale pixels to ghost over hours.
void MipiDsiDriver::displayRefreshSleep() {
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    if (!ioHandle) return;
    // Power the panel back up (replays vendor init; backlight stays at 0).
    wakeFromHardReset();
    // Drive opposite-polarity full-frame cycles to cancel accumulated DC bias.
    for (int i = 0; i < DISPLAY_DEBIAS_CYCLES; i++) {
        fillFramebuffers(0xFFFF);  // white
        delay(DISPLAY_DEBIAS_HOLD_MS);
        fillFramebuffers(0x0000);  // black
        delay(DISPLAY_DEBIAS_HOLD_MS);
    }
    // Soft landing: hold a uniform black frame with the panel still scanning so
    // its per-frame inversion averages the residual LC/VCOM bias toward zero,
    // instead of freezing the panel on the last-driven polarity. fillFramebuffers
    // already left black above; the settle is the dwell that matters.
    fillFramebuffers(0x0000);  // black (explicit; cheap and self-documenting)
#if DISPLAY_DEBIAS_SETTLE_MS > 0
    delay(DISPLAY_DEBIAS_SETTLE_MS);
#else
    delay(5);
#endif
    // Graceful DCS power-down: Display Off → (VCOM discharge window) → Sleep In,
    // then hold RST LOW. The dwell on Display Off gives the panel's internal
    // VCOM/source discharge time to equalize so it powers down from a balanced
    // state, mirroring displaySleep() but with the extra settle the abrupt
    // periodic path lacked. RST low alone would reset the controller regardless,
    // but mirroring the standard power-down keeps the resting state identical to
    // a normal sleep entry.
    esp_lcd_panel_io_tx_param(ioHandle, 0x28, NULL, 0);  // Display Off
#if DISPLAY_DEBIAS_SETTLE_MS > 0
    delay(DISPLAY_DEBIAS_SETTLE_MS);
#else
    delay(20);
#endif
    esp_lcd_panel_io_tx_param(ioHandle, 0x10, NULL, 0);  // Sleep In
    digitalWrite(LCD_RST_PIN, LOW);
#else
    blankFramebuffers();
#endif
}
